In [62]:
import pandas as pd

In [63]:
df_movies = pd.read_csv('IMDB movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDB ratings.csv')

In [64]:
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

In [4]:
# NOT NEEDED HERE ---------------------------
# df_movies.set_index('imdb_title_id', inplace=True)
# df_ratings.set_index('imdb_title_id', inplace=True)

# 1 merge()

In [5]:
# merge on 'id' :- it only counts the common columns and data. 
# that is available to both the dataframes.

In [6]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                   'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                   'job': ['Doctor', 'Statistician', 'Accountant', 'Developer']})

## 1.1 Inner Join

In [7]:
df_in_join = df1.merge(df2, on='id', how='inner')

In [8]:
print(df1.shape)
print(df2.shape)
print(df_in_join.shape)

(4, 2)
(4, 2)
(2, 3)

In [9]:
df_in_join

  id  age           job
0  C   25        Doctor
1  D   22  Statistician

### 1.1.1 Excercise

In [10]:
# merge df_movies and df_ratings (inner join)
df_joined_ex = df_movies.merge(df_ratings, on='imdb_title_id', how='inner')

In [11]:
print(df_movies.shape)
print(df_ratings.shape)
print(df_joined_ex.shape)

(85855, 22)
(85855, 49)
(85855, 70)

In [12]:
df_joined_ex.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics', 'weighted_average_vote',
       'total_votes', 'mean_vote', 'median_vote', 'votes_10', 'votes_9',
       'votes_8', 'votes_7', 'votes_6', 'votes_5', 'votes_4', 'votes_3',
       'votes_2', 'votes_1', 'allgenders_0age_avg_vote',
       'allgenders_0age_votes', 'allgenders_18age_avg_vote',
       'allgenders_18age_votes', 'allgenders_30age_avg_vote',
       'allgenders_30age_votes', 'allgenders_45age_avg_vote',
       'allgenders_45age_votes', 'males_allages_avg_vote',
       'males_allages_votes', 'males_0age_avg_vote', 'males_0age_votes',
       'males_18age_avg_vote', 'males_18age_votes', 'males_30age_avg_vote',
       'males_30age_votes', 'males_45age_avg_vote', 'males_45age_votes',
       'females_allages_avg_vote', 'females_allages_votes',
       'females_0age_avg_vote', 'females_0age_votes', 'females_18age_avg_vote',
       'females_18age_votes', 'females_30age_avg_vote', 'females_30age_votes',
       'females_45age_avg_vote', 'females_45age_votes',
       'top1000_voters_rating', 'top1000_voters_votes', 'us_voters_rating',
       'us_voters_votes', 'non_us_voters_rating', 'non_us_voters_votes'],
      dtype='object')

In [13]:
print("df_movies : ", df_movies.columns)
print("df_ratings : ",df_ratings.columns)

df_movies :  Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')
df_ratings :  Index(['imdb_title_id', 'weighted_average_vote', 'total_votes', 'mean_vote',
       'median_vote', 'votes_10', 'votes_9', 'votes_8', 'votes_7', 'votes_6',
       'votes_5', 'votes_4', 'votes_3', 'votes_2', 'votes_1',
       'allgenders_0age_avg_vote', 'allgenders_0age_votes',
       'allgenders_18age_avg_vote', 'allgenders_18age_votes',
       'allgenders_30age_avg_vote', 'allgenders_30age_votes',
       'allgenders_45age_avg_vote', 'allgenders_45age_votes',
       'males_allages_avg_vote', 'males_allages_votes', 'males_0age_avg_vote',
       'males_0age_votes', 'males_18age_avg_vote', 'males_18age_votes',
       'males_30age_avg_vote', 'males_30age_votes', 'males_45age_avg_vote',
       'males_45age_votes', 'females_allages_avg_vote',
       'females_allages_votes', 'females_0age_avg_vote', 'females_0age_votes',
       'females_18age_avg_vote', 'females_18age_votes',
       'females_30age_avg_vote', 'females_30age_votes',
       'females_45age_avg_vote', 'females_45age_votes',
       'top1000_voters_rating', 'top1000_voters_votes', 'us_voters_rating',
       'us_voters_votes', 'non_us_voters_rating', 'non_us_voters_votes'],
      dtype='object')

# 1.2 Outer Join (Full join)

In [14]:
# outer join :- joins both dataframes and all the data rows and columns , 
# if data not in both df's it puts the NaN

In [15]:
print(df1)
print("")
print(df2)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [16]:
# shapes 
print(df1.shape)
print(df2.shape)

(4, 2)
(4, 2)

In [17]:
df_outer_join = df1.merge(df2, on='id', how='outer')

In [18]:
df_outer_join.shape

(6, 3)

In [19]:
df_outer_join

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

### 1.2.1 Excercise

In [20]:
# merge df_movies and df_ratings (outer join)
df_join_out = df_movies.merge(df_ratings, on='imdb_title_id', how='outer')

In [21]:
df_join_out

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,NaN,Alexander Black,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,Comedy,95,"France, Belgium",French,Ludovic Colbeau-Justin,...,5.7,11.0,5.0,2.0,5.5,12.0,6.3,22.0,5.3,214.0
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,"Comedy, Drama",103,Netherlands,"German, Dutch",Johan Nijenhuis,...,8.0,47.0,7.3,30.0,7.0,6.0,6.8,13.0,7.7,388.0
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Malayalam,Vineesh Aaradya,...,NaN,NaN,NaN,NaN,1.0,1.0,NaN,NaN,2.0,2.0
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Turkish,Ahmet Faik Akinci,...,NaN,NaN,7.0,1.0,4.0,3.0,1.7,5.0,5.8,5.0
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,Drama,74,Spain,Catalan,Laura Jou,...,6.8,4.0,7.5,4.0,7.0,4.0,6.7,13.0,6.7,60.0

In [22]:
# shape
print(df_movies.shape)
print(df_ratings.shape)
print(df_join_out.shape)

(85855, 22)
(85855, 49)
(85855, 70)

# 1.3 Exclusive Outer join (Exclusive Full Join)

combines rows and columns that are not commons.

In [23]:
# show dataframes 
print(df1)
print("")
print(df2)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [24]:
# normal outer join 
df1.merge(df2, on='id', how='outer')

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [25]:
# indicator = 'True'
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [26]:
# query --- (left only and Right only) NOT COMMON
df1.merge(df2, on='id', how='outer', 
          indicator=True).query("_merge=='left_only' or _merge=='right_only'")

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

### 1.3.1 Excercise

In [27]:
# merge df_movies and df_ratings 
df_movies.merge(df_ratings, on='imdb_title_id', 
                how='outer', indicator=True)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes,_merge
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,NaN,Alexander Black,...,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0,both
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0,both
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0,both
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0,both
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,Le lion,2020,2020-01-29,Comedy,95,"France, Belgium",French,Ludovic Colbeau-Justin,...,11.0,5.0,2.0,5.5,12.0,6.3,22.0,5.3,214.0,both
85851,tt9911196,De Beentjes van Sint-Hildegard,De Beentjes van Sint-Hildegard,2020,2020-02-13,"Comedy, Drama",103,Netherlands,"German, Dutch",Johan Nijenhuis,...,47.0,7.3,30.0,7.0,6.0,6.8,13.0,7.7,388.0,both
85852,tt9911774,Padmavyuhathile Abhimanyu,Padmavyuhathile Abhimanyu,2019,2019-03-08,Drama,130,India,Malayalam,Vineesh Aaradya,...,NaN,NaN,NaN,1.0,1.0,NaN,NaN,2.0,2.0,both
85853,tt9914286,Sokagin Çocuklari,Sokagin Çocuklari,2019,2019-03-15,"Drama, Family",98,Turkey,Turkish,Ahmet Faik Akinci,...,NaN,7.0,1.0,4.0,3.0,1.7,5.0,5.8,5.0,both
85854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,2020-02-05,Drama,74,Spain,Catalan,Laura Jou,...,4.0,7.5,4.0,7.0,4.0,6.7,13.0,6.7,60.0,both

In [28]:
# Exclusive Outer Join 
df_movies.merge(df_ratings, on='imdb_title_id', how='outer', 
                indicator=True).query("_merge=='left_only' or _merge=='right_only'")

Empty DataFrame
Columns: [imdb_title_id, title, original_title, year, date_published, genre, duration, country, language, director, writer, production_company, actors, description, avg_vote, votes, budget, usa_gross_income, worlwide_gross_income, metascore, reviews_from_users, reviews_from_critics, weighted_average_vote, total_votes, mean_vote, median_vote, votes_10, votes_9, votes_8, votes_7, votes_6, votes_5, votes_4, votes_3, votes_2, votes_1, allgenders_0age_avg_vote, allgenders_0age_votes, allgenders_18age_avg_vote, allgenders_18age_votes, allgenders_30age_avg_vote, allgenders_30age_votes, allgenders_45age_avg_vote, allgenders_45age_votes, males_allages_avg_vote, males_allages_votes, males_0age_avg_vote, males_0age_votes, males_18age_avg_vote, males_18age_votes, males_30age_avg_vote, males_30age_votes, males_45age_avg_vote, males_45age_votes, females_allages_avg_vote, females_allages_votes, females_0age_avg_vote, females_0age_votes, females_18age_avg_vote, females_18age_votes, females_30age_avg_vote, females_30age_votes, females_45age_avg_vote, females_45age_votes, top1000_voters_rating, top1000_voters_votes, us_voters_rating, us_voters_votes, non_us_voters_rating, non_us_voters_votes, _merge]
Index: []

[0 rows x 71 columns]

In [29]:
# there are no data that is not common.

# 1.4 Left Join

left join :- only contains data from left df and common data.

In [30]:
# show dataFrames
print(df1)
print("")
print(df2)

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant
3  F     Developer

In [31]:
# left merge (join)
df1.merge(df2, on='id', how='left')

  id  age           job
0  A   30           NaN
1  B   23           NaN
2  C   25        Doctor
3  D   22  Statistician

### 1.4.1 Excercise

In [32]:
# extract a 50% sample of the df_movies dataframe
df_sample_movies = df_movies.sample(frac=0.5, random_state=2)

In [33]:
# merge the df_movies and df_ratings 
df_left_join = df_sample_movies.merge(df_ratings, on='imdb_title_id', how='left')

In [34]:
# shape ---- 
print("df_sample_movies : ",df_sample_movies.shape)
print("df_ratings : ", df_ratings.shape)
print("df_left_join : ", df_left_join.shape)

df_sample_movies :  (42928, 22)
df_ratings :  (85855, 49)
df_left_join :  (42928, 70)

In [35]:
df_left_join

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0069436,Nessuna pietà per Ulzana,Ulzana's Raid,1972,1973-03-12,"Adventure, Western",103,USA,"English, Apache languages",Robert Aldrich,...,6.8,130.0,6.8,117.0,6.8,262.0,7.1,1252.0,7.0,2560.0
1,tt3486626,Nut Job 2: Tutto molto divertente,The Nut Job 2: Nutty by Nature,2017,2017-09-14,"Animation, Adventure, Comedy",91,Canada,English,Cal Brunker,...,5.5,363.0,6.0,90.0,4.8,154.0,5.1,764.0,5.5,2209.0
2,tt0062094,Panico nella città,Panic in the City,1968,1968-02-01,"Sci-Fi, Thriller",97,USA,English,Eddie Davis,...,6.5,2.0,4.8,4.0,5.4,28.0,5.9,56.0,5.0,30.0
3,tt4795546,Nocturama,Nocturama,2016,2016-08-31,"Drama, Thriller",130,"France, Germany, Belgium",French,Bertrand Bonello,...,6.3,205.0,5.7,53.0,5.8,140.0,6.7,538.0,6.4,2306.0
4,tt0129568,Watchers Reborn,Watchers Reborn,1998,1998-06-30,"Horror, Sci-Fi",90,USA,English,John Carl Buechler,...,5.6,36.0,4.9,24.0,3.9,46.0,4.0,236.0,3.2,230.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
42923,tt0035617,Il nemico ci ascolta,Air Raid Wardens,1943,1943-04-01,"Action, Adventure, Comedy",67,USA,"English, German",Edward Sedgwick,...,7.4,23.0,6.3,34.0,5.8,103.0,6.4,360.0,6.1,347.0
42924,tt0031983,La vita di Vernon e Irene Castle,The Story of Vernon and Irene Castle,1939,1947-02-15,"Biography, Drama, Musical",93,USA,English,H.C. Potter,...,7.1,253.0,7.2,238.0,6.7,155.0,7.0,930.0,6.7,747.0
42925,tt1846487,Reality,Reality,2012,2012-09-28,"Comedy, Drama",116,"Italy, France","Italian, Neapolitan, English, Latin",Matteo Garrone,...,6.8,346.0,6.4,131.0,5.8,84.0,6.9,361.0,6.8,3118.0
42926,tt0053417,Vi er allesammen tossede,Vi er allesammen tossede,1959,1959-12-18,Comedy,83,Denmark,Danish,Sven Methling,...,7.2,9.0,8.0,1.0,5.1,12.0,6.2,4.0,6.8,106.0
42927,tt0081461,Vergiss beim Sex die Liebe nicht - Der neue Sc...,Vergiss beim Sex die Liebe nicht - Der neue Sc...,1980,1980-08-14,"Comedy, Drama",86,West Germany,German,Walter Boos,...,10.0,1.0,5.0,2.0,3.8,25.0,4.0,19.0,3.9,88.0

# 1.5 Exclusive Left Join

contains only the data that belongs to left side DataFrame.

In [36]:
# shape 
print(df1.shape)
print(df2.shape)

(4, 2)
(4, 2)

In [37]:
# merge Exclusive Left ----- indicator=True, and .query()
df_left = df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='left_only'")

In [38]:
df_left.shape

(2, 4)

In [39]:
df_left

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

### 1.5.1 Excercise

In [40]:
# make a copy of the df_movies dataFrame
df_movies2 = df_movies.copy()

In [41]:
df_movies2.index

RangeIndex(start=0, stop=85855, step=1)

In [42]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
for index in df_movies2.index:
    if index < 1000:
        df_movies2.loc[index, 'imdb_title_id'] = "tt1234567890"

In [43]:
# merge df_movies_2 and df_ratings (exclusive left join)
df_left_exclusive = df_movies2.merge(df_ratings, on='imdb_title_id', how='outer', 
                  indicator=True).query("_merge=='left_only'")

In [44]:
# shape
print(df_left_exclusive.shape)
print(df_ratings.shape)
print(df_movies2.shape)

(1000, 71)
(85855, 49)
(85855, 22)

# 1.6 Right Join

In [45]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                   'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                   'job': ['Doctor', 'Statistician', 'Accountant', 'Developer']})

In [47]:
df_right = df1.merge(df2, on='id', how='right')

In [49]:
print(df1.shape)
print(df2.shape)
print(df_right.shape)

(4, 2)
(4, 2)
(4, 3)

In [48]:
df_right

  id   age           job
0  C  25.0        Doctor
1  D  22.0  Statistician
2  E   NaN    Accountant
3  F   NaN     Developer

### 1.6.1 Excercise

In [65]:
# Extract a 30% sample of the df_ratings dataframe 
df_sample_ratings = df_ratings.sample(frac=0.3)

In [66]:
# merge df_movies and df_ratings_sample (right join)
df_right_ex = df_movies.merge(df_sample_ratings, on='imdb_title_id', how='right')

In [67]:
# shape
print(df_movies.shape)
print(df_sample_ratings.shape)
print(df_right_ex.shape)

(85855, 5)
(25756, 3)
(25756, 7)

In [68]:
df_right_ex

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0034681,Dr. Renault's Secret,1942,"Horror, Mystery, Romance",USA,414,6.3
1,tt0808185,Den brysomme mannen,2006,"Comedy, Drama, Fantasy","Norway, Iceland",16188,7.4
2,tt0253194,Kunwara,2000,"Comedy, Drama, Romance",India,804,5.4
3,tt0066980,Il delitto del diavolo (Le regine),1970,"Fantasy, Horror","Italy, France",255,6.4
4,tt0059742,Tutti insieme appassionatamente,1965,"Biography, Drama, Family",USA,198561,8.1
...,...,...,...,...,...,...,...
25751,tt0043919,La follia del silenzio,1951,"Drama, Film-Noir",USA,279,6.8
25752,tt4034390,Cut to the Chase,2016,"Action, Crime, Thriller",USA,283,5.6
25753,tt3007302,Boy Meets Girl,2014,"Comedy, Drama, Romance",USA,4152,7.2
25754,tt1879012,Night of the Living Dead 3D: Re-Animation,2012,"Action, Comedy, Horror",USA,1877,3.5
25755,tt0391728,Adam and Eve,2005,"Comedy, Drama, Romance",USA,2666,4.9

# 1.7 Exclusive Right Join

contains only the data that is in the right side dataframe !!

In [74]:
# 1. Merge
# 2. Indicator True
# 3. Query

In [75]:
# df1 and df2 merge (exclusive right)
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [76]:
df_ex_right = df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='right_only'")

In [77]:
df_ex_right

  id  age         job      _merge
4  E  NaN  Accountant  right_only
5  F  NaN   Developer  right_only

### 1.7.1 Excercise

In [81]:
# make a copy of the df_ratings dataframe
df_ratings_2 = df_ratings.copy()

In [82]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
for index in df_ratings_2.index:
    if index < 1000 :
        df_ratings_2.loc[index, 'imdb_title_id'] = 'tt1234567890'

In [84]:
# merge df_movies and df_ratings_2 (exclusive right join)
df_excl_right = df_movies.merge(df_ratings_2, on='imdb_title_id', how='outer', 
                          indicator=True).query("_merge=='right_only'")

In [85]:
# shape 
print(df_movies.shape)
print(df_ratings_2.shape)
print(df_excl_right.shape)

(85855, 5)
(85855, 3)
(1000, 8)

In [86]:
df_excl_right

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
55817,tt1234567890,NaN,NaN,NaN,NaN,154.0,5.9,right_only
55818,tt1234567890,NaN,NaN,NaN,NaN,589.0,6.3,right_only
55819,tt1234567890,NaN,NaN,NaN,NaN,188.0,6.0,right_only
55820,tt1234567890,NaN,NaN,NaN,NaN,446.0,5.3,right_only
55821,tt1234567890,NaN,NaN,NaN,NaN,2237.0,6.9,right_only
...,...,...,...,...,...,...,...,...
56812,tt1234567890,NaN,NaN,NaN,NaN,128.0,5.8,right_only
56813,tt1234567890,NaN,NaN,NaN,NaN,160.0,6.6,right_only
56814,tt1234567890,NaN,NaN,NaN,NaN,106.0,7.2,right_only
56815,tt1234567890,NaN,NaN,NaN,NaN,172.0,6.2,right_only
56816,tt1234567890,NaN,NaN,NaN,NaN,103.0,7.0,right_only